{"pages":[{"text":"Welcome to foodie.rsegebre.com, a place to talk share content about (1) recipes, (2) document any food experiences around Boston and neighboring areas, (3) figure out ways in which technology can innovate cooking and (4) criticize/try-out recipes that I find online and see how feasable they are. This will get updated later on with more details... For the time being this will have some of my to-do tasks for this website. TODO: * Fix tiptue searching * Generate sitemap * Create Pages for each of the 4 purposes of this website * Figure out the best way to include images in recipes. If you have any questons feel free to use the comment box below. ~rs","tags":"pages","loc":"http://foodie.rsegebre.com/pages/about.html","title":"About"},{"text":"Ingredients: 2 lbs of Round Bone Cut Beef Baby Corn Yellow Corn 2-4 Carrots Potatoes 1 Small Whole Green Cabbage Green Beans Cilantro Onions Zucchini Yucca (optional) Beets (optional) Beef Broth (optional) Preparation: Start by boiling 6 cups of water. Then put some salt and pepper on the Round Bone Cut Beef, and put into the boiling water. Add a bit of cilantro, a dash of cumin, and some salt and pepper. Reduce to a simmer and allow to cook for 2-4 hours, depending on how strong the broth turns out. If you have a pressure cooker, the meat will turn more tender faster and you will have a better broth, but don't worry if you don't. Clean the whole kernel and cut in 2 inch chunks. Cut the carrots in 1/2 inch quarters ( cut vertically into 4 parts then cut into 1/2 chunks ). Clean the potatoes and cut into medium sized chunks ( about 1 in by 2 in chunks ) Cut the zucchini into 1/2 inch quarters just like the carrots. Peel the yucca and cut like the potatoes. Dice the onion in chunks. Cut the cabbage into eight chunks. Cut the baby corn in halves, horizontally. Cooking Instructions: Once the beef is easilly separate by a fork, stop cooking it ( about 2-3 hours). On a separate pot big enough to contain all the vegetables, pour a cup of water in it and start boiling it. If you are using the yucca add the yucca and corn first and allow to boil for 20 minutes. Then pour the broth you had prepared into the big pot. Then add the potatoes, carrot, cabbage, onions, baby corn (if it is not pre-cooked) and the round Bone Cut beef from the pot with the broth. Now, simmer for another 20 minutes with the lid. Then proceed to add the remaining ingredients, cilantro, green beans and zuchinni. Then simmer for 30 minutes with the lid. You should simmer this until the yucca is tender to the fork, potatoes are ready, whole corn is ready. Make sure you taste and adjust seasoning, I like to test for seasoning as I go, since every round of introducing new vegetables the broth might get sweeter, richer from all the flavor released by the vegetables. I also always ended up making a weak broth, so I ended up using those cube beef broths. Note(s): I usually boil a couple of whole peeled beets separately, and cut into slices, so you can add to the soup as you serve it. That and you must have this with some turmeric, thin noodles, slightly salted long grain rice. I will be writing the recipe for this later.","tags":"Recipes","loc":"http://foodie.rsegebre.com/vegetable-and-beef-bone-soup.html","title":"Vegetable and Beef Bone Soup"},{"text":"Ingredients: 15-18 oz can of Chickpeas Parsley/Coriander 3 garlic cloves ½ Onion Bread Crumbs or Flour 1 Eggs Salt/pepper Cumin Preparation: Drain Chickpeas. Mince the garlic, onions and parsley; add a couple tablespoons of oil and place in a separate container to blend into a paste. Then add the chickpeas to the paste and blend further. Or if no blend is available you can mash the chickpeas with the bottom of a water cup. Mix the paste and the mashed chickpeas together, adding 2 tablespoons of cumin, salt and pepper to taste, a beaten egg and ¼ cup of breadcrumbs. Mix thoroughly, if mixture is too wet add more breadcrumbs. You should be able to for a small circular pattys without them breaking or cracking. To form the patties, wet your hands and take a tablespoon of the falafel mix into your hands to roll a ball. Then flatten it to form a ½ inch disk or so and place on a plate. Cooking Instructions: Once you are done preparing all the falafels, get a pan on medium-low heat add enough vegetable oil to cover half of the falafels. Wait until the oil is hot enough, you can test by adding a bit of the falafel mix and seeing if bubbles start coming out. Then you can start putting the falafels in the frying pan. Cook 5 minutes on each side, or until brown crispy outside. Note: I like eating these with lightly toasted pita bread cut in half to make a small pocket to insert falafels. Then add a little sauce which is a mixture of diced cucumber, tomatoes, plain greek yogurt, a dash or two of milk and salt. Enjoy and let me know if you have any suggestions below! ~rs","tags":"Recipes","loc":"http://foodie.rsegebre.com/falafels.html","title":"Falafels"},{"text":"Ingredients: assorted chilli peppers ( i.e. jalapenos, habanero, scotch bonnet, etc) (at least 1) onion (½ medium onion) garlic ( 4 cloves) cilantro (optional) (8 stems) salt/pepper/cumin For red Salsa: ~ yields 1 cup regular red tomatoes ( 4 roma or small tomatoes ) For green Salsa: ~ yields 1 cup jitomates ( green tomatoes) (5 jitomates) Preparation: Set two cups of water to boil with 3 dashes of salt. Wash/rinse tomatoes and jalapenos, and peel garlic and onions. Cut the onion in half and remove the ends ( the root and the tip). Take the top center part of the tomato (where it used to attach to the plant) and then with a small knife make a very shallow incision around the tomato vertically, this will aid in removing the skins later on. Cut stem of jalapenos or pepper, and remove seeds if you want to make it less spicy Cooking Instructions: Put the tomatoes, chilli peppers, garlic, onion and cilantro in the boiling water. Boil until the tomato skins are easy to take out. Then pour the water used to boil the tomatoes on the side and put the tomatoes, garlic, onions, chilli peppers and cilantro in a blender or a container to be mashed with a fork. You can use the water that you put on a side to adjust the thickness of the sauce. Then proceed to grab an empty pan and set on the stove at medium heat, once oil is hot enough pour the salsa. Add salt/pepper/cumin to taste and simmer for 5 minutes. You can boil longer if you want to make the salsa thicker or less if you like the current texture. This step is meant to reduce the tartness of the tomatoes and allow spices to blend in. Note(s): Removing the skins is optional since it depends what you are using the salsa for. If it is for mexican rice then you probably want to remove the skins and you want a more liquid salsa versus a more chunky and thick one. You can choose to mash the vegetables with a fork to give it more of a chunky texture, but you might need to boil vegetables a bit longer before attempting to mash them. Also if you are using the salsa for a dish that is being served cold, remember to adjust spices and test when the salsa is cold and not hot. Enjoy, and let me know how it turned out in the comments below! ~rs","tags":"Recipes","loc":"http://foodie.rsegebre.com/mexican-salsa.html","title":"Mexican Salsa"}]}